package com.henry.tryout.easy_coding.data_structure_and_collection_06.collection_and_generic_05.Type_restraint_01;


import java.util.ArrayList;
import java.util.List;

// 验证：① 无泛型约束的集合，什么东西 都能 往集合中添加;
// ② 有泛型约束的集合，编译器 会阻止 向其中添加 不正确的类型;
// ③ 有通配符约束的集合，不能再 向其中添加 任何元素； - 应用：方法参数类型 + 方法返回值类型
public class ListNoGeneric {
    public static void main(String[] args) {

        // 没有泛型之前，定义集合的方式
        // 特征： List没有做任何的 类型限制 - 这种做法很危险
        List a1 = new ArrayList();
        a1.add(new Object());
        a1.add(new Integer(111));
        a1.add(new String("hello a1a1"));

        /* 添加 Object的泛型限制 👇 */
        // 特征：什么样类型的元素 都可以 向list中添加
        List<Object> a2 = a1;
        a2.add(new Object());
        a2.add(new Integer(222));
        a2.add(new String("hello a2a2"));

        /* 添加 Integer的泛型限制 👇 */
        // 特征：编译器 只允许 向list中添加 Integer类型的元素
        List<Integer> a3 = a1;
        a3.add(new Integer(333));
        // 添加了 泛型限制 后，不再允许添加 非Integer类型的item 进入集合
//        a3.add(new Object());
//        a3.add(new String("hello a3a3"));

        /* 添加 ?的泛型限制 - 通配符限制 */
        // 特征：允许 删除和清空元素，但不允许 添加任何元素
        List<?> a4 = a1;
        a1.remove(0);
        a4.clear();
//        a4.add(new Object());
    }
}
/*
启示：
     1 ?在正则表达式中 可以匹配任何字符；
     2 List<?> 类型变量 能够接受 任何类型的集合引用；
     3 List<?> 变量，不能够添加元素，但可以remove() 与 clear()。
     List<?>应用：
        1 作为方法 参数的类型 来 接收 外部传入的集合；
        2 返回一个 不知道 元素类型 具体是什么的集合。
 */
